foxval/esp-idf/components/soc/esp32c/include/soc/slc_struct.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SLC_STRUCT_H_
#define _SOC_SLC_STRUCT_H_
#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    union {
        struct {
            uint32_t slc0_tx_rst:         1;
            uint32_t slc0_rx_rst:         1;
            uint32_t ahbm_fifo_rst:       1;
            uint32_t ahbm_rst:            1;
            uint32_t slc0_tx_loop_test:   1;
            uint32_t slc0_rx_loop_test:   1;
            uint32_t slc0_rx_auto_wrback: 1;
            uint32_t slc0_rx_no_restart_clr: 1;
            uint32_t slc0_rxdscr_burst_en: 1;
            uint32_t slc0_rxdata_burst_en: 1;
            uint32_t slc0_rxlink_auto_ret: 1;
            uint32_t slc0_txlink_auto_ret: 1;
            uint32_t slc0_txdscr_burst_en: 1;
            uint32_t slc0_txdata_burst_en: 1;
            uint32_t slc0_token_auto_clr: 1;
            uint32_t slc0_token_sel:      1;
            uint32_t slc1_tx_rst:         1;
            uint32_t slc1_rx_rst:         1;
            uint32_t slc0_wr_retry_mask_en: 1;
            uint32_t slc1_wr_retry_mask_en: 1;
            uint32_t slc1_tx_loop_test:   1;
            uint32_t slc1_rx_loop_test:   1;
            uint32_t slc1_rx_auto_wrback: 1;
            uint32_t slc1_rx_no_restart_clr: 1;
            uint32_t slc1_rxdscr_burst_en: 1;
            uint32_t slc1_rxdata_burst_en: 1;
            uint32_t slc1_rxlink_auto_ret: 1;
            uint32_t slc1_txlink_auto_ret: 1;
            uint32_t slc1_txdscr_burst_en: 1;
            uint32_t slc1_txdata_burst_en: 1;
            uint32_t slc1_token_auto_clr: 1;
            uint32_t slc1_token_sel:      1;
        };
        uint32_t val;
    } conf0;
    union {
        struct {
            uint32_t frhost_bit0:             1;
            uint32_t frhost_bit1:             1;
            uint32_t frhost_bit2:             1;
            uint32_t frhost_bit3:             1;
            uint32_t frhost_bit4:             1;
            uint32_t frhost_bit5:             1;
            uint32_t frhost_bit6:             1;
            uint32_t frhost_bit7:             1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t cmd_dtc:                 1;
            uint32_t rx_quick_eof:            1;
            uint32_t host_pop_eof_err:              1;
            uint32_t reserved28:                    4;
        };
        uint32_t val;
    } slc0_int_raw;
    union {
        struct {
            uint32_t frhost_bit0:            1;
            uint32_t frhost_bit1:            1;
            uint32_t frhost_bit2:            1;
            uint32_t frhost_bit3:            1;
            uint32_t frhost_bit4:            1;
            uint32_t frhost_bit5:            1;
            uint32_t frhost_bit6:            1;
            uint32_t frhost_bit7:            1;
            uint32_t rx_start:               1;
            uint32_t tx_start:               1;
            uint32_t rx_udf:                 1;
            uint32_t tx_ovf:                 1;
            uint32_t token0_1to0:            1;
            uint32_t token1_1to0:            1;
            uint32_t tx_done:                1;
            uint32_t tx_suc_eof:             1;
            uint32_t rx_done:                1;
            uint32_t rx_eof:                 1;
            uint32_t tohost:                 1;
            uint32_t tx_dscr_err:            1;
            uint32_t rx_dscr_err:            1;
            uint32_t tx_dscr_empty:          1;
            uint32_t host_rd_ack:            1;
            uint32_t wr_retry_done:          1;
            uint32_t tx_err_eof:             1;
            uint32_t cmd_dtc:                1;
            uint32_t rx_quick_eof:           1;
            uint32_t host_pop_eof_err:             1;
            uint32_t reserved28:                   4;
        };
        uint32_t val;
    } slc0_int_st;
    union {
        struct {
            uint32_t frhost_bit0:             1;
            uint32_t frhost_bit1:             1;
            uint32_t frhost_bit2:             1;
            uint32_t frhost_bit3:             1;
            uint32_t frhost_bit4:             1;
            uint32_t frhost_bit5:             1;
            uint32_t frhost_bit6:             1;
            uint32_t frhost_bit7:             1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t cmd_dtc:                 1;
            uint32_t rx_quick_eof:            1;
            uint32_t host_pop_eof_err:              1;
            uint32_t reserved28:                    4;
        };
        uint32_t val;
    } slc0_int_ena;
    union {
        struct {
            uint32_t frhost_bit0:             1;
            uint32_t frhost_bit1:             1;
            uint32_t frhost_bit2:             1;
            uint32_t frhost_bit3:             1;
            uint32_t frhost_bit4:             1;
            uint32_t frhost_bit5:             1;
            uint32_t frhost_bit6:             1;
            uint32_t frhost_bit7:             1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t cmd_dtc:                 1;
            uint32_t rx_quick_eof:            1;
            uint32_t host_pop_eof_err:              1;
            uint32_t reserved28:                    4;
        };
        uint32_t val;
    } slc0_int_clr;
    union {
        struct {
            uint32_t frhost_bit8:             1;
            uint32_t frhost_bit9:             1;
            uint32_t frhost_bit10:            1;
            uint32_t frhost_bit11:            1;
            uint32_t frhost_bit12:            1;
            uint32_t frhost_bit13:            1;
            uint32_t frhost_bit14:            1;
            uint32_t frhost_bit15:            1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t reserved25:              7;
        };
        uint32_t val;
    } slc1_int_raw;
    union {
        struct {
            uint32_t frhost_bit8:            1;
            uint32_t frhost_bit9:            1;
            uint32_t frhost_bit10:           1;
            uint32_t frhost_bit11:           1;
            uint32_t frhost_bit12:           1;
            uint32_t frhost_bit13:           1;
            uint32_t frhost_bit14:           1;
            uint32_t frhost_bit15:           1;
            uint32_t rx_start:               1;
            uint32_t tx_start:               1;
            uint32_t rx_udf:                 1;
            uint32_t tx_ovf:                 1;
            uint32_t token0_1to0:            1;
            uint32_t token1_1to0:            1;
            uint32_t tx_done:                1;
            uint32_t tx_suc_eof:             1;
            uint32_t rx_done:                1;
            uint32_t rx_eof:                 1;
            uint32_t tohost:                 1;
            uint32_t tx_dscr_err:            1;
            uint32_t rx_dscr_err:            1;
            uint32_t tx_dscr_empty:          1;
            uint32_t host_rd_ack:            1;
            uint32_t wr_retry_done:          1;
            uint32_t tx_err_eof:             1;
            uint32_t reserved25:             7;
        };
        uint32_t val;
    } slc1_int_st;
    union {
        struct {
            uint32_t frhost_bit8:             1;
            uint32_t frhost_bit9:             1;
            uint32_t frhost_bit10:            1;
            uint32_t frhost_bit11:            1;
            uint32_t frhost_bit12:            1;
            uint32_t frhost_bit13:            1;
            uint32_t frhost_bit14:            1;
            uint32_t frhost_bit15:            1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t reserved25:              7;
        };
        uint32_t val;
    } slc1_int_ena;
    union {
        struct {
            uint32_t frhost_bit8:             1;
            uint32_t frhost_bit9:             1;
            uint32_t frhost_bit10:            1;
            uint32_t frhost_bit11:            1;
            uint32_t frhost_bit12:            1;
            uint32_t frhost_bit13:            1;
            uint32_t frhost_bit14:            1;
            uint32_t frhost_bit15:            1;
            uint32_t rx_start:                1;
            uint32_t tx_start:                1;
            uint32_t rx_udf:                  1;
            uint32_t tx_ovf:                  1;
            uint32_t token0_1to0:             1;
            uint32_t token1_1to0:             1;
            uint32_t tx_done:                 1;
            uint32_t tx_suc_eof:              1;
            uint32_t rx_done:                 1;
            uint32_t rx_eof:                  1;
            uint32_t tohost:                  1;
            uint32_t tx_dscr_err:             1;
            uint32_t rx_dscr_err:             1;
            uint32_t tx_dscr_empty:           1;
            uint32_t host_rd_ack:             1;
            uint32_t wr_retry_done:           1;
            uint32_t tx_err_eof:              1;
            uint32_t reserved25:              7;
        };
        uint32_t val;
    } slc1_int_clr;
    union {
        struct {
            uint32_t slc0_rx_full:    1;
            uint32_t slc0_rx_empty:   1;
            uint32_t slc0_rx_buf_len:12;
            uint32_t reserved14:      2;
            uint32_t slc1_rx_full:    1;
            uint32_t slc1_rx_empty:   1;
            uint32_t slc1_rx_buf_len:12;
            uint32_t reserved30:      2;
        };
        uint32_t val;
    } rx_status;
    union {
        struct {
            uint32_t rxfifo_wdata:   9;
            uint32_t reserved9:      7;
            uint32_t rxfifo_push:    1;
            uint32_t reserved17:    15;
        };
        uint32_t val;
    } slc0_rxfifo_push;
    union {
        struct {
            uint32_t rxfifo_wdata:   9;
            uint32_t reserved9:      7;
            uint32_t rxfifo_push:    1;
            uint32_t reserved17:    15;
        };
        uint32_t val;
    } slc1_rxfifo_push;
    union {
        struct {
            uint32_t slc0_tx_full: 1;
            uint32_t slc0_tx_empty: 1;
            uint32_t reserved2: 14;
            uint32_t slc1_tx_full: 1;
            uint32_t slc1_tx_empty: 1;
            uint32_t reserved18:14;
        };
        uint32_t val;
    } tx_status;
    union {
        struct {
            uint32_t txfifo_rdata:  11;
            uint32_t reserved11:     5;
            uint32_t txfifo_pop:     1;
            uint32_t reserved17:    15;
        };
        uint32_t val;
    } slc0_txfifo_pop;
    union {
        struct {
            uint32_t txfifo_rdata:  11;
            uint32_t reserved11:     5;
            uint32_t txfifo_pop:     1;
            uint32_t reserved17:    15;
        };
        uint32_t val;
    } slc1_txfifo_pop;
    union {
        struct {
            uint32_t addr:            20;
            uint32_t reserved20:       8;
            uint32_t stop:             1;
            uint32_t start:            1;
            uint32_t restart:          1;
            uint32_t park:             1;
        };
        uint32_t val;
    } slc0_rx_link;
    union {
        struct {
            uint32_t addr:            20;
            uint32_t reserved20:       8;
            uint32_t stop:             1;
            uint32_t start:            1;
            uint32_t restart:          1;
            uint32_t park:             1;
        };
        uint32_t val;
    } slc0_tx_link;
    union {
        struct {
            uint32_t addr:            20;
            uint32_t bt_packet:        1;
            uint32_t reserved21:       7;
            uint32_t stop:             1;
            uint32_t start:            1;
            uint32_t restart:          1;
            uint32_t park:             1;
        };
        uint32_t val;
    } slc1_rx_link;
    union {
        struct {
            uint32_t addr:            20;
            uint32_t reserved20:       8;
            uint32_t stop:             1;
            uint32_t start:            1;
            uint32_t restart:          1;
            uint32_t park:             1;
        };
        uint32_t val;
    } slc1_tx_link;
    union {
        struct {
            uint32_t slc0_intvec:     8;
            uint32_t reserved8:       8;
            uint32_t slc1_intvec:     8;
            uint32_t reserved24:      8;
        };
        uint32_t val;
    } intvec_tohost;
    union {
        struct {
            uint32_t wdata:            12;
            uint32_t wr:                1;
            uint32_t inc:               1;
            uint32_t inc_more:          1;
            uint32_t reserved15:        1;
            uint32_t token0:           12;
            uint32_t reserved28:        4;
        };
        uint32_t val;
    } slc0_token0;
    union {
        struct {
            uint32_t wdata:            12;
            uint32_t wr:                1;
            uint32_t inc:               1;
            uint32_t inc_more:          1;
            uint32_t reserved15:        1;
            uint32_t token1:           12;
            uint32_t reserved28:        4;
        };
        uint32_t val;
    } slc0_token1;
    union {
        struct {
            uint32_t wdata:            12;
            uint32_t wr:                1;
            uint32_t inc:               1;
            uint32_t inc_more:          1;
            uint32_t reserved15:        1;
            uint32_t token0:           12;
            uint32_t reserved28:        4;
        };
        uint32_t val;
    } slc1_token0;
    union {
        struct {
            uint32_t wdata:            12;
            uint32_t wr:                1;
            uint32_t inc:               1;
            uint32_t inc_more:          1;
            uint32_t reserved15:        1;
            uint32_t token1:           12;
            uint32_t reserved28:        4;
        };
        uint32_t val;
    } slc1_token1;
    union {
        struct {
            uint32_t slc0_check_owner:   1;
            uint32_t slc0_tx_check_sum_en: 1;
            uint32_t slc0_rx_check_sum_en: 1;
            uint32_t cmd_hold_en:        1;
            uint32_t slc0_len_auto_clr:  1;
            uint32_t slc0_tx_stitch_en:  1;
            uint32_t slc0_rx_stitch_en:  1;
            uint32_t reserved7:          9;
            uint32_t slc1_check_owner:   1;
            uint32_t slc1_tx_check_sum_en: 1;
            uint32_t slc1_rx_check_sum_en: 1;
            uint32_t host_int_level_sel: 1;
            uint32_t slc1_tx_stitch_en:  1;
            uint32_t slc1_rx_stitch_en:  1;
            uint32_t clk_en:             1;
            uint32_t reserved23:         9;
        };
        uint32_t val;
    } conf1;
    uint32_t slc0_state0;                                  /**/
    uint32_t slc0_state1;                                  /**/
    uint32_t slc1_state0;                                  /**/
    uint32_t slc1_state1;                                  /**/
    union {
        struct {
            uint32_t txeof_ena:        6;
            uint32_t reserved6:        2;
            uint32_t fifo_map_ena:     4;
            uint32_t slc0_tx_dummy_mode: 1;
            uint32_t hda_map_128k:     1;
            uint32_t slc1_tx_dummy_mode: 1;
            uint32_t reserved15:       1;
            uint32_t tx_push_idle_num:16;
        };
        uint32_t val;
    } bridge_conf;
    uint32_t slc0_to_eof_des_addr;                         /**/
    uint32_t slc0_tx_eof_des_addr;                         /**/
    uint32_t slc0_to_eof_bfr_des_addr;                     /**/
    uint32_t slc1_to_eof_des_addr;                         /**/
    uint32_t slc1_tx_eof_des_addr;                         /**/
    uint32_t slc1_to_eof_bfr_des_addr;                     /**/
    union {
        struct {
            uint32_t mode:         3;
            uint32_t reserved3:    1;
            uint32_t addr:         2;
            uint32_t reserved6:   26;
        };
        uint32_t val;
    } ahb_test;
    union {
        struct {
            uint32_t cmd_st:          3;
            uint32_t reserved3:       1;
            uint32_t func_st:         4;
            uint32_t sdio_wakeup:     1;
            uint32_t reserved9:       3;
            uint32_t bus_st:          3;
            uint32_t reserved15:      1;
            uint32_t func1_acc_state: 5;
            uint32_t reserved21:      3;
            uint32_t func2_acc_state: 5;
            uint32_t reserved29:      3;
        };
        uint32_t val;
    } sdio_st;
    union {
        struct {
            uint32_t slc0_token_no_replace: 1;
            uint32_t slc0_infor_no_replace: 1;
            uint32_t slc0_rx_fill_mode:    1;
            uint32_t slc0_rx_eof_mode:     1;
            uint32_t slc0_rx_fill_en:      1;
            uint32_t slc0_rd_retry_threshold:11;
            uint32_t slc1_token_no_replace: 1;
            uint32_t slc1_infor_no_replace: 1;
            uint32_t slc1_rx_fill_mode:    1;
            uint32_t slc1_rx_eof_mode:     1;
            uint32_t slc1_rx_fill_en:      1;
            uint32_t slc1_rd_retry_threshold:11;
        };
        uint32_t val;
    } rx_dscr_conf;
    uint32_t slc0_txlink_dscr;                             /**/
    uint32_t slc0_txlink_dscr_bf0;                         /**/
    uint32_t slc0_txlink_dscr_bf1;                         /**/
    uint32_t slc0_rxlink_dscr;                             /**/
    uint32_t slc0_rxlink_dscr_bf0;                         /**/
    uint32_t slc0_rxlink_dscr_bf1;                         /**/
    uint32_t slc1_txlink_dscr;                             /**/
    uint32_t slc1_txlink_dscr_bf0;                         /**/
    uint32_t slc1_txlink_dscr_bf1;                         /**/
    uint32_t slc1_rxlink_dscr;                             /**/
    uint32_t slc1_rxlink_dscr_bf0;                         /**/
    uint32_t slc1_rxlink_dscr_bf1;                         /**/
    uint32_t slc0_tx_erreof_des_addr;                      /**/
    uint32_t slc1_tx_erreof_des_addr;                      /**/
    union {
        struct {
            uint32_t slc0_token:12;
            uint32_t reserved12: 4;
            uint32_t slc1_token:12;
            uint32_t reserved28: 4;
        };
        uint32_t val;
    } token_lat;
    union {
        struct {
            uint32_t wr_retry_threshold:11;
            uint32_t reserved11:        21;
        };
        uint32_t val;
    } tx_dscr_conf;
    uint32_t cmd_infor0;                                /**/
    uint32_t cmd_infor1;                                /**/
    union {
        struct {
            uint32_t len_wdata:          20;
            uint32_t len_wr:              1;
            uint32_t len_inc:             1;
            uint32_t len_inc_more:        1;
            uint32_t rx_packet_load_en:   1;
            uint32_t tx_packet_load_en:   1;
            uint32_t rx_get_used_dscr:    1;
            uint32_t tx_get_used_dscr:    1;
            uint32_t rx_new_pkt_ind:      1;
            uint32_t tx_new_pkt_ind:      1;
            uint32_t reserved29:          3;
        };
        uint32_t val;
    } slc0_len_conf;
    union {
        struct {
            uint32_t len:       20;
            uint32_t reserved20:12;
        };
        uint32_t val;
    } slc0_length;
